Masmiseim36/nxpSDK/boards/frdmk22f_sa9500/project_template/pin_mux.c
    const port_pin_config_t S_SPI_SCLK = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Fast slew rate is configured */
                                          kPORT_FastSlewRate,
                                          /* Passive filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Open drain is disabled */
                                          kPORT_OpenDrainDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Pin is configured as SPI1_SCK */
                                          kPORT_MuxAlt7,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          kPORT_UnlockRegister};
    /* PORTD5 (pin 62) is configured as SPI1_SCK */
    PORT_SetPinConfig(BOARD_S_SPI_SCLK_PORT, BOARD_S_SPI_SCLK_PIN, &S_SPI_SCLK);

    const port_pin_config_t S_SPI_MOSI = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Fast slew rate is configured */
                                          kPORT_FastSlewRate,
                                          /* Passive filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Open drain is disabled */
                                          kPORT_OpenDrainDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Pin is configured as SPI1_SOUT */
                                          kPORT_MuxAlt7,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          kPORT_UnlockRegister};
    /* PORTD6 (pin 63) is configured as SPI1_SOUT */
    PORT_SetPinConfig(BOARD_S_SPI_MOSI_PORT, BOARD_S_SPI_MOSI_PIN, &S_SPI_MOSI);

    const port_pin_config_t SPI_S_MISO = {/* Internal pull-up/down resistor is disabled */
                                          kPORT_PullDisable,
                                          /* Fast slew rate is configured */
                                          kPORT_FastSlewRate,
                                          /* Passive filter is disabled */
                                          kPORT_PassiveFilterDisable,
                                          /* Open drain is disabled */
                                          kPORT_OpenDrainDisable,
                                          /* Low drive strength is configured */
                                          kPORT_LowDriveStrength,
                                          /* Pin is configured as SPI1_SIN */
                                          kPORT_MuxAlt7,
                                          /* Pin Control Register fields [15:0] are not locked */
                                          kPORT_UnlockRegister};
    /* PORTD7 (pin 64) is configured as SPI1_SIN */
    PORT_SetPinConfig(BOARD_SPI_S_MISO_PORT, BOARD_SPI_S_MISO_PIN, &SPI_S_MISO);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
SHIELD_InitI2C1Pins:
- options: {prefix: SHIELD_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '37', peripheral: I2C0, signal: SCL, pin_signal: ADC0_SE12/PTB2/I2C0_SCL/UART0_RTS_b/FTM0_FLT3, slew_rate: fast, open_drain: enable, pull_select: up,
    pull_enable: enable}
  - {pin_num: '38', peripheral: I2C0, signal: SDA, pin_signal: ADC0_SE13/PTB3/I2C0_SDA/UART0_CTS_b/FTM0_FLT0, slew_rate: fast, open_drain: enable, pull_select: up,
    pull_enable: enable}
  - {pin_num: '35', peripheral: GPIOB, signal: 'GPIO, 0', pin_signal: ADC0_SE8/ADC1_SE8/PTB0/LLWU_P5/I2C0_SCL/FTM1_CH0/FTM1_QD_PHA, direction: INPUT, slew_rate: fast,
    open_drain: disable, drive_strength: low, pull_select: down, pull_enable: disable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : SHIELD_InitI2C1Pins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void SHIELD_InitI2C1Pins(void)
{
    /* Port B Clock Gate Control: Clock enabled */
    CLOCK_EnableClock(kCLOCK_PortB);

    gpio_pin_config_t INT_O_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB0 (pin 35)  */
    GPIO_PinInit(SHIELD_INT_O_GPIO, SHIELD_INT_O_PIN, &INT_O_config);

    const port_pin_config_t INT_O = {/* Internal pull-up/down resistor is disabled */
                                     kPORT_PullDisable,
                                     /* Fast slew rate is configured */
                                     kPORT_FastSlewRate,
                                     /* Passive filter is disabled */
                                     kPORT_PassiveFilterDisable,
                                     /* Open drain is disabled */
                                     kPORT_OpenDrainDisable,
                                     /* Low drive strength is configured */
                                     kPORT_LowDriveStrength,
                                     /* Pin is configured as PTB0 */
                                     kPORT_MuxAsGpio,
                                     /* Pin Control Register fields [15:0] are not locked */
                                     kPORT_UnlockRegister};
    /* PORTB0 (pin 35) is configured as PTB0 */
    PORT_SetPinConfig(SHIELD_INT_O_PORT, SHIELD_INT_O_PIN, &INT_O);

